GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c

/********1*********2*********3*********4*********5*********6*********7**********
*
*                                  board_STM32_uart.c
*
*
*   Common Logic for UART support for STM32 MCUs.
*
*   Uses a combination of HAL_Library (mostly for configuration) and direct
*   register calls (main execution).
*
*   Specific chip dependences are mainly constrained to tables (GPIOs used
*   specific UART modules supported, etc). They are pulled in as #includes
*   based on MCU type.
*
*   In general, the use of #ifdefs within the code has been minimized, in
*   order to keep things read-able and maintainable.
*
*   Note: _All_ UART Read/Write routines are interrupt based.
*         HAL libraries calls are only used for GPIO Init and UART Init.
*
*
*
*  History:
*    09/18/15 - Additional factoring on UART support for GSM and ESP8266. Duq
*    09/22/15 - Even when transmitting, run with RXNE Receive interrupts turned
*               on to handle any echo-plexed responses (at startup) from FDX
*               devices like SIM-80x and ESP8266. Otherwise you get all kinds of
*               of ORE errors during Transmit and missed sync up on Receives.
*               Incoming received characters are saved in internal RX circular buffer,
*               that user app can either process or discard. (Under the covers
*               this is how the Arduino UART support works, and that is what
*               those FDX devices are tuned for.) ST's HAL logic only turns on
*               RXNE for receives, and immediately turns them off when complete.
*               That causes "issues" when working with SIM-80x, ESP8266, etc.
*   09/23/15 - Finished final tweaks to RX interrupts and circular queue support.
*   09/24/15 - Re-factored for easier cross-MCU support. Duq
*   11/01/15 - Add more checks for RX errors that can lead to persistent ORE
*              errors, causing looping in the UART common ISR.
*              And clear associated ICR for those platforms that support it. Duq
*   11/02/15 - Turn off TE (Transmit Enable) after last transmit byte sent, else
*              can get lots of bogus trailing zeros rcvd by RX side, because
*              Xmitter is still active (TDR = 0), even though rupts are turned off.
*              Downside is it can cause intermitent FE Framing Errors.  ARGGGGG
* -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
*
* The MIT License (MIT)
*
* Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
*
* Permission is hereby granted, free of charge, to any person obtaining a copy
* of this software and associated documentation files (the "Software"), to deal
* in the Software without restriction, including without limitation the rights
* to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
* copies of the Software, and to permit persons to whom the Software is
* furnished to do so, subject to the following conditions:
* 
* The above copyright notice and this permission notice shall be included in
* all copies or substantial portions of the Software.
* 
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
* IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
* AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
* LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
* OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
* THE SOFTWARE.
*******************************************************************************/

#define  USES_CIRC_BUF                1  // UART uses Circular buffer facility
#define  IO_INTERNAL_CIRC_BUF_SIZE 0x7F  // modulo value for 128 byte buffer

#include "user_api.h"                   // pull in API defs and MCU depdent defs
#include "device_config_common.h"
#include "boarddef.h"


extern  uint32_t   _g_systick_millisecs;

//-------------------------------------------------
//          Trace / Debug     Globals
//-------------------------------------------------
#define  UART_TRACE_BUF_SIZE   0x1FF

        uint8_t    _g_rx_trace[UART_TRACE_BUF_SIZE+1];  // 512 byte RX trace
        int        _g_rx_trace_idx = 0;
        uint8_t    _g_tx_trace[UART_TRACE_BUF_SIZE+1];  // 512 byte TX trace
        int        _g_tx_trace_idx = 0;

        long       tx_char_sent    = 0;                 // API  DEBUG COUNTERs
        long       rx_char_rcvd    = 0;
        long       tx_send_calls   = 0;
        long       rxne_rupt_count = 0;                 // RUPT DEBUG COUNTERs
        long       ore_rupt_count  = 0;
        long       txe_rupt_count  = 0;
        long       tc_rupt_count   = 0;
        long       other_rx_err_rupt_count = 0;
        long       idle_rupt_count = 0;

typedef struct periph_io_block        // Peripheral I/O Control Block (I/O Buffers)
    {
        uint8_t    *io_user_buffer;   // Ptr to current spot in User I/O buf
        uint16_t   io_buf_length;     // Total amount of data to send/rcv
        uint16_t   io_tx_amt_sent;    // Amount of data send/rcv so far
        uint8_t    io_init;           //     1 = has been initialized
        uint8_t    io_state_T;        // Current state of the module: Reset/Busy/Complete
        uint8_t    io_state_R;        // RX state (if needed) Reset/Busy/Complete
        uint8_t    io_use_interrupts; // 1 = use interrupts,     0 = poll
        uint8_t    io_blocking;       // 1 = I/O is blocking. Wait till I/O is
                                      //  complete before return to user app
        uint8_t    io_master_slave;   // 1 = Master, 2 = Slave
        int        io_semaphore;      // I/O wait semaphore
        uint32_t   io_max_timeout_val;// max time to wait for I/O (millisec)
        uint32_t   io_expiry_time;    // timeout deadline for I/O response
        void       *io_HAL_handle;    // HAL Typedef Handle to use for this I/O
     IO_CB_EVENT_HANDLER io_callback_handler; // optional callback routine
        void             *io_callback_parm;   // user callback parm
        uint8_t    *io_rcv_user_buf;
        uint16_t   io_rcv_max_length;
        uint16_t   io_rx_amt_rcvd;
#if defined(USES_CIRC_BUF)
        uint8_t    io_rx_buf [IO_INTERNAL_CIRC_BUF_SIZE+1];    // 128 bytes
        int        io_buf_rx_head;    // head and tail ptrs for ioblock->io_rx_buf
        int        io_buf_rx_tail;
        int        io_buf_echo_head;  // head and tail ptrs for ioblock->io_echo_buf
        int        io_buf_echo_tail;
        uint8_t    *io_rcv_echo_ptr;  // current char being echo-plexed in user rcv buf
        uint8_t    io_do_echoplex;    // echo-plexing is turned on
        uint8_t    io_is_string_IO;   // current operation is a read_text_line, etc
        uint8_t    io_str_last_char;  // keeps track of user text input (\r \n ...)
#endif
    } IO_BUF_BLK;

    IO_BUF_BLK   *_g_ioblock_uart_trc;   // DEBUG trace of current I/O Buf Block

