GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
               // valid states for UART io_state_T and io_state_R
#define  UART_STATE_XMIT_BUSY           1
#define  UART_STATE_RCV_VIA_INTERRUPTS  2
#define  UART_STATE_XMIT_COMPLETE       3
#define  UART_STATE_RCV_COMPLETE        4
#define  UART_STATE_RESET               5

int  board_get_uart_io_block (unsigned int module_id, IO_BUF_BLK **ret_ioblock);
int  board_uart_enable_clock (int module_id);       // internal routines
void board_uart_enable_nvic_irq (int module_id);
void  board_uart_perform_echoplex (int module_id, IO_BUF_BLK *ioblock, uint8_t *rcv_end_buf);
int  board_uart_process_activation_chars (IO_BUF_BLK  *ioblock,
                                          uint8_t in_char, uint8_t *read_buf);
int  board_uart_read_common (unsigned int module_id, IO_BUF_BLK *ioblock, uint8_t *read_buf,
                             int buf_max_length, int is_string_IO);
int  board_get_uart_handle (int module_id, UART_HandleTypeDef **ret_UartHdl);
void board_common_UART_IRQHandler (USART_TypeDef *uart_module, int uart_module_id);
void USART1_IRQHandler (void);
void USART2_IRQHandler (void);
void USART3_IRQHandler (void);
void USART6_IRQHandler (void);

     //------------------------------------------------------------------------

#if defined(STM32F030x8) || defined(STM32F070xB)
//                                         STM32 - F030 / F072  Nucleo
#include "STM32_F0/board_F0_tables_uart.c"
#endif

#if defined(STM32F072xB)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_uart.c"
#endif


#if defined(STM32F091xC)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_tables_F0_uart.c"
#endif


#if defined(STM32F103xB)
//                                         STM32 - F103  Nucleo
#include "STM32_F1/board_F1_tables_uart.c"
#define  MAX_SPI   4
#endif


#if defined(STM32F303xC) || defined(STM32F303xE)
//                                         STM32 - F303  Nucleo and Discovery
//#include "STM32_F3/board_F303_tables_uart.c"
#include "STM32_F3/board_F3xx_tables_uart.c"
#endif


#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo and Discovery
#include "STM32_F3/board_F3xx_tables_uart.c"
#endif

#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
//                                         STM32 - F401/F411  Nucleos
#include "STM32_F4/board_F4xx_tables_uart.c"
#endif

#if defined(STM32F446xx)
//                                         STM32 - F446  Nucleo
#include "STM32_F4/board_F4xx_tables_uart.c"
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "stm32f7xx_hal_usart.h"
#include "STM32_F7/board_F7_tables_uart.c"
#endif


#if defined(STM32L053xx)
//                                         STM32 - L053  Nucleo
#include "stm32l0xx_hal_usart.h"
#include "STM32_L0/board_L0_tables_uart.c"
#define  MAX_SPI   3
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo
#include "stm32l1xx_hal_usart.h"
#include "STM32_L1/board_L1_tables_uart.c"
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Discovery/Nucleo
#include "STM32_L4/board_L4_tables_uart.c"
#endif


//----------------------------------------------------------------------
//  Handle differences in ST's naming of UART Xmit/Rcv/Status Registers
//----------------------------------------------------------------------
#if defined(STM32F030x8)  || defined(STM32F070xB) || defined(STM32F072xB) || defined(STM32F091xC) \
  || defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F334x8) \
  || defined(STM32F746xx) || defined(STM32F746NGHx) \
  || defined(STM32L053xx) || defined(STM32L476xx)
#define  RCV_REG         RDR
#define  STATUS_REG      ISR
#define  XMIT_REG        TDR
#define  USART_SR_RXNE   USART_ISR_RXNE
#define  USART_SR_TXE    USART_ISR_TXE
#define  USART_SR_TC     USART_ISR_TC
#define  USART_SR_TEACK  USART_ISR_TEACK
#define  USART_SR_IDLE   USART_ISR_IDLE        /* IDLE DETECT vs TE ? */
#define  USART_SR_ORE    USART_ISR_ORE
#define  USART_SR_OTHER_RE_ERRS  (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE | USART_ISR_ORE | USART_ISR_RTOF | USART_ISR_ABRE)
#define  USART_ICR_CLEAR_FLAGS   (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NCF | USART_ICR_ORECF | USART_ICR_RTOCF)
#define  USART_ICR_CLEAR_IDLE    (USART_ICR_IDLECF)
#else
#define  RCV_REG         DR
#define  STATUS_REG      SR
#define  XMIT_REG        DR
#define  USART_SR_OTHER_RE_ERRS  (USART_SR_PE | USART_SR_FE | USART_SR_NE | USART_SR_ORE | USART_SR_RTOF | USART_SR_ABRE)
#define  USART_ICR_CLEAR_FLAGS   (USART_CR_PECF | USART_CR_FECF | USART_CR_NCF | USART_CR_ORECF | USART_CR_RTOCF)
#define  USART_ICR_CLEAR_IDLE    (USART_CR_IDLECF)
#endif


//*****************************************************************************
//*****************************************************************************
//                              UART   Routines
//
//        Routines to Init, Read, and Write to a UART module.
//        Only provides for TX/RX support, no support for RTS/CTS.
//
//  VCP Notes:
//        The VCP (Virtual Comm Port), is the default UART TX/RX pins connected
//        from the Nucleo or Discovery board to the onboard ST-Link component,
//        that provides serial UART emulation to a PC via USB CDC protocol.
//        On Nucleos, this is wired to the "Arduino" D1/D0 pins on the bottom
//        right Arduino connector. These pins are effectively dedicated to
//        the VCP function, and will not work as GPIOs, unless you re-solder
//        the solder bridges on the Nucleo (in which case, you lose VCP support)
//*****************************************************************************
//*****************************************************************************


//*****************************************************************************
//*****************************************************************************
//                        GENERIC    UART    Routines
//*****************************************************************************
//*****************************************************************************


//*****************************************************************************
// board_get_uart_io_block
//
//          Gets the UART IO_BLOCK to use for this UART instance
//*****************************************************************************
int  board_get_uart_io_block (unsigned int module_id, IO_BUF_BLK **ret_ioblock)
{
    IO_BUF_BLK    *ioblock;

    if (module_id > UART_MAX_MODULE)
       return (ERR_UART_MODULE_NUM_OUT_OF_RANGE);

    if (_g_uart_io_blk_address[module_id] == 0L)
       return (ERR_UART_MODULE_NOT_SUPPORTED);

    *ret_ioblock = (IO_BUF_BLK*) _g_uart_io_blk_address [module_id];

    return (0);               // denote worked OK
}



//*****************************************************************************
//  board_uart_init
//
//
//       CAUTION: you MUST set _g_UartHandle_x.Init.Parity to UART_PARITY_NONE,
//                otherwise HAL Lib will default to odd parity and turn on the
//                UART CR1 PCE and PS bits, which totally screws things up !
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//*****************************************************************************

int  board_uart_init (unsigned int module_id, int tx_pin_id,
                      int rx_pin_id, long baud_rate, int flags)
{
    IO_BUF_BLK          *ioblock;
    UART_HandleTypeDef  *pUartHdl;
    USART_TypeDef       *uart_hwbase;
    GPIO_TypeDef        *tx_GPIO_port;     /* TX GPIO port   */
    uint32_t            tx_GPIO_pin;       /* TX GPIO pin    */
    uint32_t            tx_AltFuncId;      /* TX Alt Func Id (pin mux) */
    GPIO_TypeDef        *rx_GPIO_port;     /* RX GPIO port   */
    uint32_t            rx_GPIO_pin;       /* RX GPIO pin    */
    uint32_t            rx_AltFuncId;      /* RX Alt Func Id (pin mux) */
    int                 rc;
    GPIO_InitTypeDef    GPIO_InitStruct;

