GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

    _g_rx_trace_idx = 0;        // reset index used for DEBUG "long trace buf"

        //---------------------------------------------------------------------
        // Get pointers to UART module Hardware base address, and TypeDef Handle
        //---------------------------------------------------------------------
    uart_hwbase = (USART_TypeDef*) _g_uart_HW_module [module_id];
                     // use our internal TypeDef Handle for all calls
    pUartHdl = (UART_HandleTypeDef*) _g_uart_typedef_handle_addr [module_id];

       //-----------------------------------------------------------------------
       // Locate the associated GPIO Port and GPIO Pin for TX and RX pins
       //-----------------------------------------------------------------------
    rc = board_gpio_pin_lookup (tx_pin_id, &tx_GPIO_port, &tx_GPIO_pin);
    if (rc == 0)
       rc = board_gpio_pin_lookup (rx_pin_id, &rx_GPIO_port, &rx_GPIO_pin);
    if (rc != 0)
       return (rc);                  // invalid pin_id was given to us

       //-----------------------------------------------------------------------
       // Locate the associated GPIO Port and GPIO Pin, as well as
       // the associated AF information.
       // Returns ptrs to the _g_uart_NN_gpio_table[] entries for TX and RX pins
       //-----------------------------------------------------------------------
    rc = board_uart_ALTFUNC_lookup (module_id, tx_pin_id, &tx_AltFuncId,
                                    rx_pin_id, &rx_AltFuncId);
    if (rc != 0)
       return (rc);                  // pin_id not valid for this UART instance

       //--------------------------------------------------
       //                   GPIO  Init
       //
       // Configure the GPIOs that used for the UART pins for VCP
       //  e.g.  PA.2 = USART2_TX    PA.3 = USART2_RX
       //--------------------------------------------------
    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));  // clear struct
    GPIO_InitStruct.Pin       = tx_GPIO_pin;
    GPIO_InitStruct.Alternate = tx_AltFuncId;         // set TX Alt Function - UART
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    if (flags & UART_ENABLE_PULL_UPS)
       GPIO_InitStruct.Pull   = GPIO_PULLUP;          // Pull Ups = normal TX/RX operation
       else if (flags & UART_ENABLE_PULL_DOWNS)
               GPIO_InitStruct.Pull = GPIO_PULLDOWN;
       else GPIO_InitStruct.Pull    = GPIO_NOPULL;
#if defined(GPIO_SPEED_FAST)
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
#else
    GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
#endif
    HAL_GPIO_Init (tx_GPIO_port, &GPIO_InitStruct);   // Setup UART GPIO TX pin

    GPIO_InitStruct.Pin       = rx_GPIO_pin;
    GPIO_InitStruct.Alternate = rx_AltFuncId;         // set RX Alt Function - UART
    HAL_GPIO_Init (rx_GPIO_port, &GPIO_InitStruct);   // Setup UART GPIO RX pin

       //--------------------------------------------------
       // Configure the UART module.  Default = 115200
       //--------------------------------------------------
    board_uart_enable_clock (module_id);               // Turn on UART clock

    memset (pUartHdl, 0, sizeof(UART_HandleTypeDef));  // clear the structure

    pUartHdl->Instance        = (USART_TypeDef*) _g_uart_HW_module[module_id]; // Set UART module to use
    pUartHdl->Init.BaudRate   = baud_rate;
    pUartHdl->Init.WordLength = UART_WORDLENGTH_8B;    // setup as 8N1
    pUartHdl->Init.StopBits   = UART_STOPBITS_1;
    pUartHdl->Init.Parity     = UART_PARITY_NONE;      // no parity  KEY !
    pUartHdl->Init.HwFlowCtl  = UART_HWCONTROL_NONE;   // No flow ctl
    if (flags & UART_ENABLE_OVERSAMPLING)
       pUartHdl->Init.OverSampling = UART_OVERSAMPLING_16;   // Normal UART operation
       else pUartHdl->Init.OverSampling = UART_OVERSAMPLING_16;
    pUartHdl->Init.Mode       = UART_MODE_TX_RX;       // Enable RX and TX

    HAL_UART_Init (pUartHdl);   // Keil is wacking out on this  10/02/15
//  HAL_USART_Init ((USART_HandleTypeDef*) pUartHdl);  // and screws up on this - what is wrong with that TURD ??? !!!

       //---------------------------------------------
       // UART interrrupts are _always_ used.
       //---------------------------------------------
    board_uart_enable_nvic_irq (module_id);
    ioblock->io_use_interrupts = 1; // denote all UART I/O will use interrupts

    ioblock->io_do_echoplex    = 0; // default is no auto-echo of received characters

    if (flags && UART_ENABLE_ECHOPLEX)
       ioblock->io_do_echoplex = 1; // Turn on "echo plexing" of characters received
                                    // on a READ I/O operation, i.e. automatically
                                    // echo back any received character. This is
                                    // typical in Async "Full Duplex" systems.

    ioblock->io_state_T = UART_STATE_RESET; // init TX and RX states
    ioblock->io_state_R = UART_STATE_RESET;

         //-------------------------------------------------
         // prep for any rcv queuing and/or echo-plexing
         //-------------------------------------------------
    ioblock->io_buf_rx_head   = ioblock->io_buf_rx_tail  = 0;  // reset head and tail ptrs to clr buf

//#if defined(STM32L053xx)
//#else
    __HAL_USART_ENABLE_IT (pUartHdl,USART_IT_RXNE); // ALWAYS TURN ON RX interrupts
//#endif

    return (0);            // completed OK
}


//*****************************************************************************
//  board_uart_rx_flush
//
//             Flush/discards any data left over in receive buffer.
//             Typically used to discard echo-plex characters from FDX devices, etc.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//*****************************************************************************

int  board_uart_rx_flush (unsigned int module_id, int flags)
{
    uint8_t        in_byte;
    int            rc;
    IO_BUF_BLK     *ioblock;

