GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

                 // reset/clear out the buffer, by resetting internal buf index
    ioblock->io_buf_rx_head = ioblock->io_buf_rx_tail  = 0;  // reset head/tail ptrs to clr buf
    ioblock->io_buf_echo_head = ioblock->io_buf_echo_tail = 0;

    return (0);  // denote completed OK
}


//*****************************************************************************
//  board_uart_console_read_fdx                         aka   CONSOLE_READ_LINE
//
//             Reads in a line of text from the UART in full duplex mode.
//
//             It keeps reading from the UART until it receives an Activation
//             character of either \n or \r.
//             In addition, it automatically echos back any character that
//             the user types in, to support full-duplex "echo-plex" mode.
//
//             If you do not need the echo-plexing support, then just
//             issue a uart_Read_Line() call instead, which does a similar
//             job, but without the echo-plexing, and hence lower ovverhead.
//
//             This is primarily a convenience function, so that the user app
//             does not have to redundantly implement echo-plex support, when
//             communicating with PC or Linux "teletype" application like
//             putty, teleterm, etc.
//
//             if there is no character available, then we loop in here
//             for UART input, up until the max timeout limit (max_wait_time).
//
//             However, we pause after each check, by calling sys_Delay_Millis()
//             so that in lower power apps, we can go to sleep temporarily,
//             rather than burn up the battery doing continuious busy looping.
//
//  Returns:  0   +   a line of text in user_buf, ending with \0
//            or ERR_UART_RCV_TIMED_OUT (-305)
//            or ERR_xxxMODULE_ID_OUT_OF_RANGE (-300/-301)
//*****************************************************************************

int  board_uart_console_read_fdx (unsigned int module_id, uint8_t *user_buf, int max_buf_len,
                                  int pause_time, int max_wait_time, int flags)
{
    char           in_char;
    int            rc;
    int            amt_to_read;
    uint8_t        *buf_begin;
    IO_BUF_BLK     *ioblock;

    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

             //----------------------------------------------------------------
             //              by definition, this is blocking logic.
             //
             // If user does NOT want blocking logic, then he needs to use
             // board_uart_rx_data_check() and board_uart_get_char() instead !
             //----------------------------------------------------------------
    ioblock->io_state_R = UART_STATE_RCV_COMPLETE;   // denote we a NOT using a user buffer
    ioblock->io_expiry_time = _g_systick_millisecs + max_wait_time;  // save any timeout
    buf_begin   = user_buf;
    *user_buf   = '\0';        // ensure buf is initially cleared
    amt_to_read = max_buf_len;
    while (amt_to_read)
      {      //------------------------------------------------------------------------
             //  we wait and process anything that gets queued in our internal buffers.
             //------------------------------------------------------------------------
        if (ioblock->io_buf_rx_tail != ioblock->io_buf_rx_head)
           { in_char = ioblock->io_rx_buf [ioblock->io_buf_rx_tail];
             ioblock->io_buf_rx_tail = (ioblock->io_buf_rx_tail + 1) % IO_INTERNAL_CIRC_BUF_SIZE;  // update tail ptr

                      //----------------------------------------------
                      // determine if it is an activation char or not
                      //----------------------------------------------
            rc = 0;
            if (in_char == '\b' || in_char == 0x7F)
               {     // process a backspace
                 if (user_buf != buf_begin)
                    {     // backspace the user buffer to erase the previous character
                      user_buf--;
                      *user_buf = '\0';
                      amt_to_read++;
                    }
                 rc = 2;                       // echo, but do not save the char
               }
              else if (in_char == '\r' || in_char == '\n' )
                      { if (ioblock->io_str_last_char == '\r' && user_buf != buf_begin)
                           rc = 2;  // ignore this. is last part of \r\n sequence
                           else { if (user_buf == buf_begin)
                                     *user_buf++ = '\n';  // treat as a standalone \n only line
                                   *user_buf = '\0';      // set end of string
                                   rc = 1;
                                }
                        ioblock->io_str_last_char = in_char; // save for \r\n check
                      }
                      // echo the char
            board_uart_write_bytes (module_id, &in_char, 1, UART_WAIT_FOR_COMPLETE);

            if (rc == 0)             // add a normal char to user buffer
               {
                 *user_buf++ = in_char;
                 amt_to_read--;
                 if (amt_to_read == 1)
                    {      // buffer is essentially full. add \0 and post complete
                      *user_buf = '\0';
                      rc = 1;
                    }
               }
              else if (in_char == '\r')
                      rc = 1;              // force end of line/string
            if (rc == 1)
               return (0); // Tell caller we have a complete line of text.
                           // For anything else, keep going. Backspaces are auto-deleted
                           // inside board_uart_process_activation_chars()
               // we just processed a char. update any max timeput
            ioblock->io_expiry_time = _g_systick_millisecs + max_wait_time;
           }

        if (ioblock->io_buf_rx_tail == ioblock->io_buf_rx_head)
           {          //------------------------------------------------------------
                      // buffer is temporarily empty. Wait till we rcv another char.
                      // We depend upon the interrupt handler to add any newly
                      // received characters to the internal io_rx_buf[] queue.
                      //------------------------------------------------------------
             if (pause_time != 0)
                HAL_Delay (pause_time);  // sleep for low power mode (LPM) to save battery

             if (max_wait_time)          // user has a max_timeout
                if (_g_systick_millisecs > ioblock->io_expiry_time)
                   return (ERR_UART_RCV_TIMED_OUT);  // hit the TIMEOUT limit - bail !
           }
         // loop back and process any newly received character(s)
      }

    return (0);
}


//*****************************************************************************
//  board_uart_rx_data_check                 aka   CONSOLE_CHECK_FOR_READ_DATA
//
//             Checks if any pending character input from UART.
//
//             Returns 0 if no pending data, and 1 if there is a char present.
//*****************************************************************************

int  board_uart_rx_data_check (unsigned int module_id)
{
    int            rc;
    IO_BUF_BLK     *ioblock;

// ??? 10/12/15 - May be some timeing issues in here when FULL-DUPLEX is turned on !!!
//                Might have an echoed back character in our buffer (e.g. talking to putty ?

