GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

// ??? return actual amt of data queued instead, that way app has a clue how much rcvd ???

    if (ioblock->io_buf_rx_head != ioblock->io_buf_rx_tail)
       return (1);                  // yes, we have some data in internal RX buf

    return (0);                     // no, no data has been received
}


//*****************************************************************************
//  board_uart_get_char                                 aka   CONSOLE_GET_CHAR
//
//             Read in a single raw character from the UART.
//
//             if there is no character available, then we loop in here
//             for UART input. Hence, this is a blocking call.
//             Note that no processing (\r \n) and no echo-plexing is performed.
//
//  Returns:  a char  (0-255)
//            or ERR_UART_RCV_TIMED_OUT (-305)
//            or WARN_WOULD_BLOCK       (450)
//            or ERR_xxxMODULE_ID_OUT_OF_RANGE (-300/-301)
//*****************************************************************************

int  board_uart_get_char (unsigned int module_id, int flags, int max_wait_time)
{
    int            in_char;
    int            rc;
    IO_BUF_BLK     *ioblock;

    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);
    _g_ioblock_uart_trc = ioblock;         // DEBUG trace current I/O Buf Block

return_data_to_user:
  __disable_irq();           // Disable interrupts to avoid Head/Tail corruption
   if (ioblock->io_buf_rx_head != ioblock->io_buf_rx_tail)
      {          // pull a char that is queued in internal RX buffer
        in_char = ioblock->io_rx_buf [ioblock->io_buf_rx_tail];
        ioblock->io_buf_rx_tail = (ioblock->io_buf_rx_tail + 1) % IO_INTERNAL_CIRC_BUF_SIZE;  // update tail ptr
        if (ioblock->io_str_last_char == '\r'  &&  in_char == '\n')
           {   // Yes, so ignore the \n, because we already gave end of cmd signal
               // to the user. Avoid handling up a second "end of cmd".
             ioblock->io_str_last_char = 0; // clear out \r, so we treat any new \n as real.
           }
       __enable_irq();              // Re-enable interrupts
        return (in_char);           // hand it up to caller
      }
  __enable_irq();                   // Re-enable interrupts

   if (flags & UART_IO_NON_BLOCKING)
      return (WARN_WOULD_BLOCK);

                 //----------------------------------------------
                 // wait until we receive a char or timeout
                 //----------------------------------------------
                         // for TIMEOUT checking, generate expected end time
   ioblock->io_expiry_time = _g_systick_millisecs + max_wait_time;
   while (1)
     {
       if (ioblock->io_buf_rx_head != ioblock->io_buf_rx_tail)
          goto return_data_to_user;            // we finally got some data
       if (max_wait_time)                      // user has a max timeout value
          if (_g_systick_millisecs > ioblock->io_expiry_time)
             return (ERR_UART_RCV_TIMED_OUT);  // hit the TIMEOUT limit - bail !
     }

    return (ERR_UART_RCV_TIMED_OUT);
}



//*****************************************************************************
//  board_uart_process_activation_chars
//
//             Perform CP-V style "activation character" processing for
//             received string/char data:  i.e. if we get a \r or \n, then
//             treat it as an end of string, and hand the current data up to
//             the calling user application.
//             For backspaces, delete the current character in the buffer
//             and back up 1, in the input string.
//
//             This style of processing takes a major burden of the User App
//             programmer, since he will see a "string_data\r\n" as a
//             single record, and does not need to parse the data to find
//             ending \r\n indicators. The app can wait for a complete
//             "record" or string, rather than having to do byte-at-a-time
//             (read_char) processing.
//
//       Returns status to UART_Common_IRQ_Handler which called us
//*****************************************************************************

int  board_uart_process_activation_chars (IO_BUF_BLK  *ioblock,
                                          uint8_t in_char, uint8_t *read_buf)
{
    int   event;

    event = 0;          // categorize if incoming char is a signficant event
    if (in_char == '\b' || in_char == 0x7F)
       event = 1;                          // backspace event
       else if (in_char == '\r')
               event = 2;                  // carriage return event
       else if (in_char == '\n')
               event = 3;                  // new line event

     switch (event)
       {
         case 0:
               return (0);                 // not an activation char

         case 1:                           // backspace activation char
                  // handle BACKSPACE character - erase previous char by stepping back one.
               if (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS)
                  {       // we are working directly with user buffer via active READ
                    if (ioblock->io_rx_amt_rcvd == 0) // 0 indicates 1st char in buf
                       return (2);                // no chars in buf. discard it
                    ioblock->io_rcv_user_buf--;   // backspace rcv buf 1 char
                    ioblock->io_rcv_max_length++;
                    return (2);                   // discard the backspace
                  }
                 else
                  {       // update our internal RX queue
                    if (ioblock->io_buf_rx_head == ioblock->io_buf_rx_tail)
                       return (2);             // no chars in buf. discard it
                    if (ioblock->io_buf_rx_head == 0)
                       ioblock->io_buf_rx_head = IO_INTERNAL_CIRC_BUF_SIZE; // handle a wrap around
                       else ioblock->io_buf_rx_head--;                    // update head ptr
                    ioblock->io_rx_buf [ioblock->io_buf_rx_head] = '\0';  // clear out the prev char
                    return (2);         // discard this char, but allow any echo
                  }
               break;

         case 2:                           // carriage return \r activation char
                          // handle CARRIAGE RETURN char - treat as end of line
               if (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS)
                  {       // we are working directly with user buffer via active READ
                          //----------------------------------------------------------------
                          // Check if \r is the only input char. in such a case, it is
                          // telling the user that he received a null line  (CR only).
                          // For cross-platform usage (Windows vs Unix), we always pass
                          // back a \n\0 sequence, to denote a NULL line rcvd.
                          //----------------------------------------------------------------
                    ioblock->io_str_last_char = '\r';       // save \r, to handle any \r\n sequence check
                    if (ioblock->io_rcv_user_buf != 0L)
                       { if (ioblock->io_rx_amt_rcvd == 0)        // 0 indicates 1st char in buf
                            {
                              *ioblock->io_rcv_user_buf++ = '\n'; // move in a \n to denote standalone line (CR only)
                              *ioblock->io_rcv_user_buf   = '\0'; // set end of string null terminator
                            }
                           else {     // strip it off, and denote end of string/text_line
                                  *ioblock->io_rcv_user_buf   = '\0'; // set end of string null terminator (to an existing string)
                                }
                       }
                    return (1);   // tell caller it is end of string/text_line
                  }
                 else
                  {       // update our internal RX queue
                          // convert it to a NL to denote an end of string/text_line
                    read_buf [ioblock->io_buf_rx_head] = '\n';   // denote end of line
                    ioblock->io_buf_rx_head = (ioblock->io_buf_rx_head + 1) % IO_INTERNAL_CIRC_BUF_SIZE; // update head ptr
                    ioblock->io_str_last_char = '\r';  // save \r, to handle any \r\n sequence check
                    return (2);
                  }
               break;

         case 3:                           // new line \n activation char
               if (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS)
                  {       // we are working directly with user buffer via an active READ
                    if (ioblock->io_str_last_char == '\r')
                       {       // this is end of a \r\n sequence. Discard the \n
                         ioblock->io_str_last_char = 0;  // clear \r\n sequence flag
                         if (ioblock->io_rx_amt_rcvd > 0)
                            return (1);   // tell rupt handler it is end of text_line
                         return (2);      // otherwise, just discard it.
                       }
                    if (ioblock->io_rcv_user_buf != 0L)
                       {
                         if (ioblock->io_rx_amt_rcvd == 0)            // 0 indicates 1st char in buf
                            {       // Otherwise, this is a standalone \n, without a previous \r.
                               // treat similar to above - return a \n to tell user that he got a null line (NL only)
                              *ioblock->io_rcv_user_buf++ = '\n';     // copy it
                              *ioblock->io_rcv_user_buf   = '\0';     // set end of string null terminator
                            }
                           else {   // we already have a bunch of chars in the buffer
                                  *ioblock->io_rcv_user_buf   = '\0'; // set end of string null terminator
                                }
                       }
                    return (1);      // tell caller it is end of string/text_line
                  }
                 else
                  {       // update our internal RX queue
                    if (ioblock->io_str_last_char == '\r')
                       { ioblock->io_str_last_char = 0;  // clear \r\n sequence flag
                         return (2);      // discard it. strip the \n when part of a \r\n sequence
                       }
                      else return (0);    // just copy the \n to internal buf
                  }
               break;
       }                                  //   end   switch()

    return (0);                 // denote more string data needs to be read in
}


//*****************************************************************************
//  board_uart_read_bytes
//
//             Reads an arbitrary block of bytes from the UART.
//             _No_ "Activation Character" processing of the datastream is
//             performed and _NO_ echo-plexing performed.
//
//        Returns:   1 if complete    or     ERR_UART_RCV_TIMED_OUT
//                                    or     ERR_xxxMODULE_ID_OUT_OF_RANGE
//*****************************************************************************

int  board_uart_read_bytes (unsigned int module_id,
                            uint8_t *read_buf, int buf_length, int flags)
{
    uint8_t        in_byte;
    int            rc;
    IO_BUF_BLK     *ioblock;

