GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

    ioblock->io_is_string_IO = 0; // denote is BINARY I/O, so _no_ Activation Char processing

    rc = board_uart_read_common (module_id,ioblock, read_buf, buf_length, 0);

    return (rc);
}


//*****************************************************************************
//  board_uart_read_common
//
//           Reads a full string of characters or binary data from the UART.
//
//           For strings, the I/O Interrupt Handler does the following:
//             When we hit an end of string sequence, e.g. \r\n (Windows)
//             or \n (Linux/Unix), we return a 1 to denote a valid cmd present.
//
//             We normally strip off the trailing \n or \r and replace it with
//             a \0, UNLESS the buffer is empty. In that case we put in \n\0
//             so that the App can determine that it is a "null" line (no
//             string, just a carriage return/line feed was hit at the console).
//
//             If it is not and end of line \n or \r, we continue to loop,
//             waiting for more UART input. (So yes, this is a blocking call).
//
//             If we reach the end of the buffer with no \n end of sequence,
//             then we truncate the cmd and hand up the buffer with \0 at end.
//
//             Note this is an absolute BARE BONES implementation, in order
//             to be able to run on small memory MCUs. The vendor's HAL
//             libraries have major bloat-ware in there, so I am avoiding them.
//
//        Returns:   1 if complete    or     ERR_UART_RCV_TIMED_OUT
//
// UART read_Xxxx() routines update only the RX tail pointer for internal RX circular queue.
//*****************************************************************************

int  board_uart_read_common (unsigned int module_id, IO_BUF_BLK *ioblock,
                             uint8_t *user_read_buf, int buf_max_length,
                             int is_string_IO)
{
    char     *begin_buf;
    char     in_char;
    int      rc;
    int      amt_left;

    _g_ioblock_uart_trc = ioblock;         // DEBUG trace current I/O Buf Block

    begin_buf = user_read_buf;
    ioblock->io_rx_amt_rcvd   = 0;
    ioblock->io_rcv_echo_ptr  = user_read_buf;

             //-----------------------------------------------------------------
             // first, move any data from internal RX queue buffer to user buf.
             //-----------------------------------------------------------------
   amt_left = buf_max_length;
__disable_irq();             // Disable interrupts to avoid Head/Tail corruption
   while (ioblock->io_buf_rx_head != ioblock->io_buf_rx_tail)
     {                       // copy from our internal buf to user app buf
       in_char = ioblock->io_rx_buf [ioblock->io_buf_rx_tail];
       *user_read_buf = in_char;
       amt_left--;
                             // update tail ptr
       ioblock->io_buf_rx_tail = (ioblock->io_buf_rx_tail + 1) % IO_INTERNAL_CIRC_BUF_SIZE;
       if (is_string_IO  &&  (in_char == '\n' || amt_left <= 1))
          {        //------------------------------------------------------
                   // we hit end of a string.  return this string to user
                   // see if this is a standalone \n  (NL only or CR only)
                   //------------------------------------------------------
            if (user_read_buf == begin_buf)
               {     // this is first char in buf so pass thru the standalone \n
                 user_read_buf++;  // step to next position in buf to put \0
               }                   // otherwise, overlay the trailing \n with \0
            *(user_read_buf) = '\0';  // ensure null terminator \0 is appended
            ioblock->io_str_last_char = 0;  // clear out any \r indicator
          __enable_irq();          // Macro to re-enable rupts
            return (1);            // tell caller we got a string
          }
         else if (amt_left == 0)
                  {
                  __enable_irq();  // Macro to re-enable rupts
                    return (1);    // tell caller we filled buffer
                  }
                                   //----------------------------------------
       user_read_buf++;            //  step to next char in user app buffer
     }                             //----------------------------------------
              //----------------------------------
              // there is still more data needed
              //----------------------------------
    ioblock->io_rx_amt_rcvd    = buf_max_length - amt_left;
    ioblock->io_rcv_max_length = amt_left;   // Save I/O length and user buf ptr
         // start Interrupt reads _after_ the chars that were already rcvd in the above head/tail loop
    ioblock->io_rcv_user_buf   = user_read_buf;   // points to next open position in user buf
    ioblock->io_state_R  = UART_STATE_RCV_VIA_INTERRUPTS; // denote I/O in progress

              // for TIMEOUT checking, generate expected end time
    ioblock->io_expiry_time = _g_systick_millisecs + ioblock->io_max_timeout_val;

              //--------------------------------------------------------------
              // Wait for intyerrupt handler to complete reading in the
              // rest of the characters. It will move them direct to user buf
              //--------------------------------------------------------------
__enable_irq();              // Macro to re-enable interrupts

// in future, call SEMAPHORE in NO_RTOS instead (to allow low power)

    while (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS)
      {    // ioblock->io_state_R will be set to UART_STATE_RCV_COMPLETE in ISR
           // when the max length has been reached, or an activation character rcvd.

           // if there is a Timeout limit, see if we reached it
        if (ioblock->io_max_timeout_val)          // user specified a max timeout
           { if (_g_systick_millisecs > ioblock->io_expiry_time)
                return (ERR_UART_RCV_TIMED_OUT);  // hit the limit - bail !
           }
      }                            //   end   while()

  return (1);                      // tell caller we filled buffer
}


//*****************************************************************************
//  board_uart_read_text_line                           aka   CONSOLE_READ_LINE
//
//              Reads a full line of of characters from the UART.
//              We keep reading until we see a \r\n or \n which denotes
//              the end of a line of text.
//
//        Returns:   1 if complete    or     ERR_UART_RCV_TIMED_OUT
//*****************************************************************************

int  board_uart_read_text_line (unsigned int module_id,
                                char *read_buf, int buf_max_length, int flags)
{
    char           in_char;
    int            rc;
    int            amt_left;
    IO_BUF_BLK     *ioblock;

