GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

    ioblock->io_is_string_IO = 1; // denote is STRING I/O, so enable Activation Char processing

    rc = board_uart_read_common (module_id, ioblock, (uint8_t*) read_buf,
                                 buf_max_length, 1);

    return (rc);
}


//*****************************************************************************
//  board_uart_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when any UART interrupt completion (or terminating error) occurs.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//*****************************************************************************
int  board_uart_set_callback (unsigned int module_id,
                              IO_CB_EVENT_HANDLER callback_function,
                              void *callback_parm)
{
    int            rc;
    IO_BUF_BLK     *ioblock;

    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

       //-------------------------------------------------------------------
       // Save any call back information, for interrupts
       //-------------------------------------------------------------------
    ioblock->io_callback_handler = callback_function;
    ioblock->io_callback_parm     = callback_parm;

    return (0);                              // indicate it worked OK
}


//*****************************************************************************
//  board_uart_set_max_timeout
//
//          Set the maximum time that the MCU should wait for a UART
//          send/receive transaction to complete.
//          If it exceeds this value, signal an error, and cancel the I/O
//          that was in progress.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//*****************************************************************************
int  board_uart_set_max_timeout (unsigned int module_id, uint32_t max_timeout)
{
    int                rc;
    IO_BUF_BLK         *ioblock;

    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);

    ioblock->io_max_timeout_val = max_timeout;       // save the receive timeout value we should use

    return (0);                              // indicate it worked OK
}


//******************************************************************************
//  board_uart_write_char                              aka   CONSOLE_WRITE_CHAR
//
//             Note this is an absolute BARE BONES implementation, in order
//             to be able to run on small memory MCUs. The vendor's HAL
//             libraries have major bloat-ware in here, so I am avoiding them.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//******************************************************************************

int  board_uart_write_char (unsigned int module_id, char outchar, int flags)
{
    return (board_uart_write_bytes(module_id, &outchar, 1, flags));
}


//******************************************************************************
//  board_uart_write_bytes
//                                                        or    DEBUG_LOG
//
//             Write an arbitrary block of bytes out the UART channel.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//******************************************************************************

int  board_uart_write_bytes (unsigned int module_id, uint8_t *bytebuf,
                             int buf_len, int flags)
{
    uint8_t            tx_char ;
    int                rc;
    UART_HandleTypeDef *pUartHdl;
    IO_BUF_BLK         *ioblock;

tx_send_calls++;

    rc = board_get_uart_io_block (module_id, &ioblock);
    if (rc != 0)
       return (rc);
    _g_ioblock_uart_trc = ioblock;         // DEBUG trace current I/O Buf Block

    pUartHdl = (UART_HandleTypeDef*) _g_uart_typedef_handle_addr [module_id];

    if (ioblock->io_state_T < UART_STATE_XMIT_COMPLETE)
       return (ERR_IO_ALREADY_IN_PROGRESS);    // user had started a previous transmit that
                                               // has not yet completed
    ioblock->io_user_buffer = bytebuf;         // save address of data to be sent
    ioblock->io_buf_length  = buf_len;         // save I/O length and contents
    ioblock->io_tx_amt_sent = 0;               // reset for new pass

    ioblock->io_state_T = UART_STATE_XMIT_BUSY;         // denote I/O in progress

// Skipping the first send in here works, apparently with no ill effects.
#if WAIT_FOR_FIRST_TXE_RUPT    // 11/02/15 HAL's code just turns on the TXE rupt and waits for rupt before sends 1st char !
           // send first byte in user buf   // Hopefully above eliminates the truncated 1st char we are seeing on RX side !
    tx_char = *ioblock->io_user_buffer++;      // Trace it
    _g_tx_trace[_g_tx_trace_idx] = tx_char;   // trace everything to a 512 byte buf
    _g_tx_trace_idx = (_g_tx_trace_idx + 1) % UART_TRACE_BUF_SIZE; // auto-wrap trace index

    pUartHdl->Instance->XMIT_REG = (uint32_t) tx_char;   // Send it
    ioblock->io_tx_amt_sent++;
tx_char_sent++;
#endif
               // _Enable_ the USART TXE Transmit data register empty Interrupt bit in CR1.
    __HAL_USART_ENABLE_IT (pUartHdl, USART_IT_TXE);
               // and _Enable_ the USART RXNE Interrupt bit in CR1 for echo-plex
    __HAL_USART_ENABLE_IT (pUartHdl, USART_IT_RXNE);

                  //---------------------------------------------------
                  // see if we need to wait for the transmission to complete
                  //--------------------------------------------------------
        if (flags & UART_IO_NON_BLOCKING)
           { return (0);    // Non-blocking: denote we started transmit I/O OK.
                            // Final status will be via callback/check_complete
           }
          else {            // calling app wants us to wait till I/O is complete
                 while (ioblock->io_state_T == UART_STATE_XMIT_BUSY)
                   ;
// in future, call SEMAPHORE in NO_RTOS instead (low power)

