GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
               }

    return (0);             // Transmit I/O completed OK
}


//******************************************************************************
//  board_uart_write_string                               aka   CONSOLE_WRITE
//                                                        or    DEBUG_LOG
//
//             Note this is an absolute BARE BONES implementation, in order
//             to be able to run on small memory MCUs. The vendor's HAL
//             libraries have major bloat-ware in here, so I am avoiding them.
//
//        Returns:   0 if OK    or     ERR_UART_MODULE_NUM_OUT_OF_RANGE
//******************************************************************************

int  board_uart_write_string (unsigned int module_id, char *outstr, int flags)
{
    return (board_uart_write_bytes(module_id, outstr, strlen(outstr), flags));
}


//*****************************************************************************
//*****************************************************************************
//
//                            UART      ISRs
//
// ISR routine updates only the RX head pointer for internal RX circular queue.
//*****************************************************************************
//*****************************************************************************

void  board_common_UART_IRQHandler (USART_TypeDef *uart_module, int uart_module_id)
{
    UART_HandleTypeDef  *pUartHdl;
    uint32_t            rupt_flag;
    uint8_t             in_char;
    uint8_t             tx_char;
    int                 next_to_last_byte_idx;
    int                 rc;
    IO_BUF_BLK          *ioblock;

    pUartHdl = (UART_HandleTypeDef*) _g_uart_typedef_handle_addr [uart_module_id];
    ioblock = (IO_BUF_BLK*) _g_uart_io_blk_address [uart_module_id];
    _g_ioblock_uart_trc = ioblock;         // DEBUG trace current I/O Buf Block

      //----------------------------------------------------------------
      // Determine what flag caused the interrupt:  RXNE, TXE, TC, OVR
      //----------------------------------------------------------------

         //----------------------------------------
         // Fileter out / Discard any IDLEs, that can screw up RX logic
         //--------------------------------------------------------------
    rupt_flag = (pUartHdl->Instance->STATUS_REG & USART_SR_IDLE);
    if (rupt_flag != 0)
       {
idle_rupt_count++;
         pUartHdl->Instance->ICR |= USART_ICR_CLEAR_IDLE;  // clear and discard it
//       in_char = (uint8_t) pUartHdl->Instance->RCV_REG;  // read and discard it ?
       }
         //----------------------------------------
         //    Process a receive RXNE
         //----------------------------------------
    rupt_flag = (pUartHdl->Instance->STATUS_REG & USART_SR_RXNE);
    if (rupt_flag != 0  &&  (pUartHdl->Instance->CR1 & USART_CR1_RXNEIE))  // verify rupt is enabled
       {
rxne_rupt_count++;
rx_char_rcvd++;
                  //------------------------------
                  //     process a rcvd byte.
                  //-------------------------------
                  // Note: reading in the byte automatically clears the RXNE rupt
         in_char = (uint8_t) pUartHdl->Instance->RCV_REG;

_g_rx_trace[_g_rx_trace_idx] = in_char;          // trace everything to a 512 byte buf
_g_rx_trace_idx = (_g_rx_trace_idx + 1) % UART_TRACE_BUF_SIZE;     // auto-wrap trace index

         rc = 0;
         if (ioblock->io_is_string_IO && (in_char <= '\r' || in_char == 0x7F))
            {     //---------------------------------------------------------------------
                  // this is string I/O, so process any special chars like \b \r or \n
                  // it returns 1 of 4 return codes:  0 = process normally,   do any echo
                  //                                  1 = operation complete, do any echo
                  //                                  2 = backspace: discard, do any echo
                  //                                 -3 = other:     discard, do NOT echo
                  //---------------------------------------------------------------------
              rc = board_uart_process_activation_chars (ioblock, in_char, ioblock->io_rx_buf);
            }

         if (rc == 0)
            { ioblock->io_str_last_char = in_char;    // save char, to handle any \r\n sequence check
                        //------------------------------------------------
                        // determine where to store the received char
                        //------------------------------------------------
              if (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS)
                 {      //------------------------------------------------
                        // we are in the middle of a user app active READ.
                        // copy it directly to the user app's buffer.
                        //------------------------------------------------
                   *ioblock->io_rcv_user_buf++ = in_char;     // save char into user rcv buffer
                   ioblock->io_rcv_max_length--;              // deduct # bytes left to rcv
                  if (ioblock->io_is_string_IO)
                     {     // see if we have hit the max size string/text_line we can put in buf
                       if (ioblock->io_rcv_max_length == 1)
                          {    // we've filled the buffer. Return completed buf to caller
                            *ioblock->io_rcv_user_buf = '\0'; // append \0 to denote end of string/text_line
                            rc = 1;                  // set condition as "read is complete"
                          }
                     }
                    else if (ioblock->io_rcv_max_length == 0) // is a uart_read_bytes() op
                            rc = 1;                  // set condition as "read is complete"
                   ioblock->io_rx_amt_rcvd++;                 // inc # bytes rcvd
                 }
                else
                 {      //--------------------------------------
                        //  queue into our internal RX buffer.
                        //--------------------------------------
                  ioblock->io_rx_buf [ioblock->io_buf_rx_head] = in_char; // save char into our internal RX queue
                        // update head ptr
                  ioblock->io_buf_rx_head = (ioblock->io_buf_rx_head + 1) % IO_INTERNAL_CIRC_BUF_SIZE;
                 }

