GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_uart.c
            }

//  ??? NEED TO HANDLE ECHO-PLEX on  in_char   !!! ???   WVD  !!! ???    (if rc != 3)

// 09/22/15
//    RE-WORK THIS TO SLIDING / ROTATING INTERNAL BUFFER ala ARDUINO, and
//    DISCARD CHARS IF REACH LIMIT, W/FLAG WARNING SET ON ANY USER RCV CALL
//    ALSO, CHANGE uart_read_string() logic to operate as a higher level,
//    that call lower level to just read chars, and upper level processes them
//    Possibly change it to a "uart_console_read() call instead ???

         if (ioblock->io_state_R == UART_STATE_RCV_VIA_INTERRUPTS  &&  rc == 1)
            {        //-----------------------------------------------------------------------
                     // we are all done with a user app "active READ".
                     // Post the operation complete and issue any callback to user.
                     //
                     // Note: Unlike HAL, we do _NOT_ turn off RX rupts, because with full
                     // duplex devices like SIM808 or ESP8266, there is always a timing window
                     // to bite us. So any subsequent rcvd chars get queued in internal buf.
                     //-----------------------------------------------------------------------
              ioblock->io_state_R = UART_STATE_RCV_COMPLETE;   // set ending status
if (ioblock->io_rx_amt_rcvd > 1)    // DEBUG HOOK for strings >  just \n
              ioblock->io_rcv_user_buf = 0L;  // clear ptr to denote no more active user READ
              if (ioblock->io_callback_handler != 0L)
                 {                            // Invoke any user callback for the interrupt
                    (ioblock->io_callback_handler) (ioblock->io_callback_parm,
                                                    uart_module_id, UART_RX_COMPLETE);
                 }
            }
       }                    //  end  if rupt_flag != 0

         //------------------------------------------
         //  Process a Receive Overrun ORE condition
         //------------------------------------------
    rupt_flag = pUartHdl->Instance->STATUS_REG & USART_SR_ORE;
    if (rupt_flag != 0)  //  &&  (pUartHdl->Instance->CR1 & USART_CR1_OREIE))  // verify rupt is enabled
       {
ore_rupt_count++;
         in_char = (uint8_t) pUartHdl->Instance->RCV_REG;   // discard whatr is in buffer
         in_char = (uint8_t) pUartHdl->Instance->RCV_REG;   // hit a second time to be sure
       }

         //----------------------------------------
         //  Process a transmit TXE buffer empty
         //----------------------------------------
    rupt_flag = pUartHdl->Instance->STATUS_REG & USART_SR_TXE;
    if (rupt_flag != 0 && (pUartHdl->Instance->CR1 & USART_CR1_TXEIE))
       {    // process a transmitted byte. Send next char if there is one.
            // Note: transmitting a new byte automatically clears the TXE rupt.
txe_rupt_count++;
         if (ioblock->io_tx_amt_sent < ioblock->io_buf_length)
            {     // send next byte in user buffer
              tx_char = *ioblock->io_user_buffer++;
              _g_tx_trace[_g_tx_trace_idx] = tx_char;   // trace everything to a 512 byte buf
              _g_tx_trace_idx = (_g_tx_trace_idx + 1) % UART_TRACE_BUF_SIZE; // auto-wrap trace index
              pUartHdl->Instance->XMIT_REG = (uint32_t) tx_char;
              ioblock->io_tx_amt_sent++;
tx_char_sent++;
            }
         if (ioblock->io_tx_amt_sent == ioblock->io_buf_length)
            {     // we are all done sending. Turn off TXE interrupt, and wait for TC interrupt
                  // to signal that the last byte's bits have cleared the transmitter.
                  // _Disable_ the USART TXE Transmit data register empty Interrupt bit in CR1.
              __HAL_USART_DISABLE_IT (pUartHdl, USART_IT_TXE);
                  // _Enable_ the USART TC Transmit Complete Interrupt bit in CR1
              __HAL_USART_ENABLE_IT (pUartHdl, USART_IT_TC);
            }
       }

         //--------------------------------------------
         // Process a transmit TC - transmit complete
         //--------------------------------------------
    rupt_flag = pUartHdl->Instance->STATUS_REG & USART_SR_TC;
    if (rupt_flag != 0)
      { if (pUartHdl->Instance->CR1 & USART_CR1_TCIE)
           {      // process a transmitted byte. Send next char if there is one.
tc_rupt_count++;
//          CLEAR_BIT (pUartHdl->Instance->CR1, USART_CR1_TE); // Turn Off TRANSMIT ENABLE to avoid sending training 0x00s/0xFFs from XMIT_REG
            if (ioblock->io_tx_amt_sent == ioblock->io_buf_length)
               {     // we are all done sending. Post operation complete and
                     // issue any callback to user
                     // _Disable_ the USART TC Transmit Complete Interrupt bit in CR1.
                 __HAL_USART_DISABLE_IT (pUartHdl, USART_IT_TC);
                     // Disable any USART Error Interrupts: (Frame error, noise error, overrun error)
////             __HAL_USART_DISABLE_IT (pUartHdl, USART_IT_ERR);

                 ioblock->io_state_T = UART_STATE_XMIT_COMPLETE;  // set ending status
                 if (ioblock->io_callback_handler != 0L)
                    {             // Invoke user callback for the interrupt
                      (ioblock->io_callback_handler) (ioblock->io_callback_parm,
                                                      uart_module_id, UART_TX_COMPLETE);
                    }
               }
           }
// 11/02/15 - Loading the XMIT_REG with 0x00 or 0xFF causes that to be sent out !!! even if rupts are off ! So this SPEC advice was total bullshit
///    pUartHdl->Instance->XMIT_REG = 0xFF;  // per tech ref, clear TC flag by writing dummy byte to DR/TDR
      }
           //-------------------------------------------------------------
           // handle any other RX errors, that can lead to an ORE lockup
           //-------------------------------------------------------------
    rupt_flag = pUartHdl->Instance->STATUS_REG & USART_SR_OTHER_RE_ERRS;
    if (rupt_flag != 0)  //  &&  (pUartHdl->Instance->CR1 & USART_CR1_OREIE))  // verify rupt is enabled
       {
other_rx_err_rupt_count++;
         in_char = (uint8_t) pUartHdl->Instance->RCV_REG;   // discard what is in buffer
         pUartHdl->Instance->ICR |= USART_ICR_CLEAR_FLAGS;  // and clear any RX error flags
       }
}                                 //   end   board_common_UART_IRQHandler()


//#if (USES_UART)                 // THIS MOVES TO stm32xx_it.c with (USES_UART) enabled
void USART1_IRQHandler (void)
{
    board_common_UART_IRQHandler (USART1, 1);
}


void USART2_IRQHandler (void)
{
    board_common_UART_IRQHandler (USART2, 2);
}

//  !!! ??? WVD need to add other IRQ support F3 and F4_46 e.g. USART4/5/.../8

#if defined(STM32F091xC) \
  || defined(STM32F446xx) \
  || defined(STM32F746xx) || defined(STM32F746NGHx) || defined(STM32L476xx)

void USART3_IRQHandler (void)
{
    board_common_UART_IRQHandler (USART3, 3);
}
#endif

#if defined(STM32F091xC) \
  || defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F446xx) \
  || defined(STM32F746xx) || defined(STM32F746NGHx)

void USART6_IRQHandler (void)
{
    board_common_UART_IRQHandler (USART6, 6);
}
#endif

//#endif                                       // (USES_UART)


/******************************************************************************/
